[
  {
    "link": "/services",
    "menu": true,
    "number": "01",
    "title": "services.",
    "accordionContent": {
      "description": "We are a team of experts who help start-ups, SMEs, government and public institutions to build maintainable web, mobile and backend applications. Our strengths are our experience and our team. We offer services that consists from building prototypes in no-time to building scalable products that deliver innovation.",
      "content": [
        {
          "component": "slideLinks",
          "data": [
            {
              "link": "/services#product-development",
              "name": "PRODUCT DEVELOPMENT"
            },
            {
              "link": "/services#extended-team",
              "name": "EXTENDED TEAM"
            },
            {
              "link": "/services#mvp-in-10-days",
              "name": "MVP IN 10 DAYS"
            }
          ]
        }
      ]
    },
    "content": [
      {
        "component": "horizontalTabs",
        "data": [
          {
            "tabName": "product development.",
            "slug": "product-development",
            "content": [
              {
                "component": "numberedParagraph",
                "data": [
                  {
                    "title": "Digitalise & innovate towards the future",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Do you have a disruptive idea? Do you think that speed and agility are key factors to succeed? We think the same. Our team has over 20 years of experience helping DAX companies innovate and launch new products and business lines. We will guide your company through all the steps of the product development cycle from the idea generation, concept development, feasibility study, customer validation and testing, all the way to market launch."
                      }
                    ]
                  },
                  {
                    "title": "Custom solutions for your business",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Innovation is disrupting many industries and businesses. Software can help you increase efficiency and quality of your processes and provide KPI metrics that support better decision making. It can help better understand your customers and by leveraging the power of data it gives you the edge needed to succeed. We can help you on your journey towards digitalisation by building software that is secure, reliable and most importantly adds value to your company."
                      }
                    ]
                  },
                  {
                    "title": "Transparent costs",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Our cost structure is based on person days. We provide a detailed estimation for the planned phase of the project in terms of time and will recommend the budget based on that. Projects typically run for 20 - 60 person days."
                      }
                    ]
                  }
                ]
              },
              {
                "component": "process",
                "data": {
                  "title": "Process",
                  "items": [
                    {
                      "title": "Introduction",
                      "description": "We will set up a call to learn more about your idea. In the next 24 hours, we’ll perform a feasibility research and get back to you with timeline and costs. We will also discuss about the next steps in details."
                    },
                    {
                      "title": "Workshop",
                      "description": "We’ll organise a workshop to discuss about further project requirements and define the scope (the backlog) for a Minimum Viable Product. In this workshop, we’ll prepare the user flows, low fidelity mockups, technical architecture and cost estimation."
                    },
                    {
                      "title": "Implementation",
                      "description": "We will start the implementation process with all the items (user stories) in the backlog. Our lean process allows you to update the backlog or reprioritize the user stories. A communication channel is established with the client, typically using Slack. We report the progress every week and release the software continuously to test environment and gather feedback."
                    },
                    {
                      "title": "Maintenance",
                      "description": "Our software development process that is focused on writing quality code, cover testing scenarios and rigorous code reviews results in less maintenance needed after release. Nevertheless, we offer a maintenance package that includes bug fixes, small changes and updates (security, libraries). Projects without active development usually require 2 - 3 days booked for maintenance."
                    }
                  ]
                }
              },
              {
                "component": "caseStudies",
                "data": {
                  "title": "Case studies.",
                  "items": [
                    {
                      "iconFilename": "moma.png",
                      "title": "MOMA",
                      "link": "/portfolio/moma",
                      "description": "Easily access your local deals"
                    },
                    {
                      "iconFilename": "last-supper.png",
                      "title": "LAST SUPPER",
                      "link": "/portfolio/last-supper",
                      "description": "Restaurant management system & client apps"
                    },
                    {
                      "iconFilename": "salt.png",
                      "title": "SALT",
                      "link": "/portfolio/salt",
                      "description": "Fancy restaurant"
                    }
                  ]
                }
              }
            ]
          },
          {
            "tabName": "extended team.",
            "slug": "extended-team",
            "content": [
              {
                "component": "numberedParagraph",
                "data": [
                  {
                    "title": "Ready for help",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Need to scale up? Need to fill a skill gap? Deadline around the corner? We got you covered! Our team of developers, designers and architects can join your team, support and then leave without any strings attached."
                      }
                    ]
                  },
                  {
                    "title": "Save time",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Let’s admit, hiring is hard. With us you can save time and get the resources you need, exactly when you need them. No recruiting. No training."
                      }
                    ]
                  },
                  {
                    "title": "Full control",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Our resources are fully incorporated into your team and you have full control over the processes."
                      }
                    ]
                  },
                  {
                    "title": "Expert skills",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Choose from the international talent pool in all its versatility of skills. To name a few: Javascript, Typescript, React, Node.JS, React Native, Swift, Kotlin, C#, Ruby on Rails, PHP, Serverless, Cloud, CI / CD and a lot more."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "tabName": "mvp in#insertnewline#10 days.",
            "slug": "mvp-in-10-days",
            "content": [
              {
                "component": "numberedParagraph",
                "data": [
                  {
                    "title": "Move fast",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "What if you could find the product-market fit in 10 days? Finding a product-market fit is always a long and complicated process. The earlier you can find it, the less money you will burn. We develop quick, light-weight prototypes (MVPs) of your ideal solution in 10 days so you can go out there and validate your product with real customer feedback."
                      }
                    ]
                  },
                  {
                    "title": "Tech Stack",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "The project will be implemented using Typescript programming language, React.JS for frontend, Node.JS for backend with GraphQL, PostgreSQL for data storage. Project will be deployed on Amazon Web Services and we will use the following services VPC, Lambda, S3, RDS, EC2, Cognito, Cloudwatch etc."
                      }
                    ]
                  },
                  {
                    "title": "Flat fee",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "No budget overrun. The service has a flat fee of €3,500. The fee covers meeting, workshop and implementation."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "link": "/expertise",
    "menu": true,
    "number": "02",
    "title": "expertise.",
    "accordionContent": {
      "description": "Our journey has led us to become experts not only in specific technologies, but also in specific industries. Explore the industries and learn more about technologies we love using to build top notch products.",
      "content": [
        {
          "component": "slideLinks",
          "data": [
            {
              "link": "/expertise#proptech",
              "name": "PROPTECH"
            },
            {
              "link": "/expertise#human-resources",
              "name": "HUMAN RESOURCES"
            }
          ]
        }
      ]
    },
    "content": [
      {
        "component": "horizontalTabs",
        "data": [
          {
            "tabName": "proptech.",
            "slug": "proptech",
            "content": [
              {
                "component": "numberedParagraph",
                "data": [
                  {
                    "title": "Best product ever",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "In ante metus dictum at tempor commodo. Mattis pellentesque id nibh tortor id. Eget mauris pharetra et ultrices neque ornare. Nec feugiat nisl pretium fusce id velit ut tortor. Viverra justo nec ultrices dui sapien eget mi. At in tellus integer feugiat scelerisque varius. Risus viverra adipiscing at in tellus. Proin fermentum leo vel orci porta. Ullamcorper eget nulla facilisi etiam dignissim. Amet massa vitae tortor condimentum lacinia quis vel."
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "tabName": "human resources.",
            "slug": "human-resources",
            "content": [
              {
                "component": "numberedParagraph",
                "data": [
                  {
                    "title": "Product Expertise",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Our team has over 20 years of experience helping DAX companies innovate and launch new products and business lines. We will guide your company through all the steps of the product development cycle from the idea generation, concept development, feasibility study, customer validation and testing, all the way to market launch."
                      }
                    ]
                  },
                  {
                    "title": "Product Development",
                    "content": [
                      {
                        "component": "markdownDisplay",
                        "data": "Finding a market fit is always a challenge. The earlier it is found the higher will be the chances of your company being successful. We use lean methodology in order to build the right products with the least amount of time and effort spent. We test for market fit early and often using data-driven product development. Iterating and adjusting quickly will allow you to learn about your customer sooner rather than later, thus ensuring a great start in the long product journey."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "link": "/portfolio",
    "menu": true,
    "number": "03",
    "title": "portfolio.",
    "accordionContent": {
      "description": "We have built feature-rich platforms, high quality products and application softwares for clients all over the world. Our team has delivered high end solutions serving a wide range of industries such as IoT, Real Estate, E-Learning, Blockchain and many others. Click below to find more information about a some of our projects, along with the feedback from our clients.",
      "content": [
        {
          "component": "slideLinks",
          "data": [
            {
              "link": "/portfolio",
              "name": "GO TO PORTFOLIO"
            }
          ]
        }
      ]
    },
    "content": [
      {
        "component": "presentationTiles",
        "data": [
          {
            "iconFilename": "cleu.png",
            "title": "CLEU",
            "link": "/portfolio/cleu",
            "description": "Bright startup ...",
            "content": [
              {
                "component": "headerImage",
                "data": {
                  "imageFileName": "cleu-hero.png"
                }
              },
              {
                "component": "quickDescription",
                "data": {
                  "title": "The morning alarm clock",
                  "description": "Used by K-12 students as their daily alarm clock, students start the day more focused and alert. Using Cleu leads to higher grit, perseverance, and class attendance. Cleu is available on the AppStore and our solutions team for district-wide pilots."
                }
              },
              {
                "component": "namedDivider",
                "data": {
                  "title": "CLIENT"
                }
              },
              {
                "component": "clientName",
                "data": {
                  "name": "CLEU"
                }
              },
              {
                "component": "quickFacts",
                "data": [
                  {
                    "title": "WHAT WE DID",
                    "type": "list",
                    "items": [
                      "Concept",
                      "UI /UX",
                      "Rapid Prototyping",
                      "AI/ML Development"
                    ]
                  },
                  {
                    "title": "TECHNOLOGIES WE USED",
                    "type": "list",
                    "items": [
                      "AWS",
                      "React",
                      "Node.js"
                    ]
                  },
                  {
                    "title": "INCREASE IN BETA USERS",
                    "type": "fact",
                    "description": "250%"
                  },
                  {
                    "title": "Hour GAP analysis",
                    "type": "fact",
                    "description": "48h"
                  }
                ]
              },
              {
                "component": "namedDivider",
                "data": {
                  "title": "THE CHALLENGE"
                }
              },
              {
                "component": "commonParagraph",
                "data": {
                  "title": "Fix most of the pressing issues and bugs",
                  "type": "horizontal",
                  "paragraphs": [
                    "Cleu founder, Uzair had fallen into the common trap of outsourcing the app development of his idea to a low-cost agency, in order to “fit” it into his limited budget.",
                    "The result was a mobile app that was a slow, unresponsive and bug prone app. He contacted Softup with the hope to fix most of the pressing issues and bugs."
                  ]
                }
              },
              {
                "component": "namedDivider",
                "data": {
                  "title": "THE PROCESS"
                }
              },
              {
                "component": "commonParagraph",
                "data": {
                  "title": "Title",
                  "type": "vertical",
                  "paragraphs": [
                    "Cleu founder, Uzair had fallen into the common trap of outsourcing the app development of his idea to a low-cost agency, in order to “fit” it into his limited budget.",
                    "The result was a mobile app that was a slow, unresponsive and bug prone app. He contacted Softup with the hope to fix most of the pressing issues and bugs."
                  ]
                }
              },
              {
                "component": "namedDivider",
                "data": {
                  "title": "THE SOLUTION"
                }
              },
              {
                "component": "paragraphAndImage",
                "data": {
                  "title": "Fixed issues",
                  "imageName": "alarm-mobile.png",
                  "imagePosition": "right",
                  "paragraphs": [
                    "One of our senior consultants quickly got to work and delivered within 48 hours a list of issues some known but most of them unknown, that needed to be handled right away for the app to be presentable in front of potential customers and investors.",
                    "All the issues were fixed in the next two weeks and shortly after Cleu was able to get a new batch of Beta users to the platform.",
                    "The founder would decide to work exclusively with Softup going forward in order to maintain the high performance and reliability of the mobile app. He scaled his development team at Softup with 3 developers working full time in order to make Cleu the most promising product in its niche."
                  ]
                }
              },
              {
                "component": "paragraphAndImage",
                "data": {
                  "title": "Fixed issues",
                  "imageName": "alarm-mobile.png",
                  "imagePosition": "left",
                  "paragraphs": [
                    "One of our senior consultants quickly got to work and delivered within 48 hours a list of issues some known but most of them unknown, that needed to be handled right away for the app to be presentable in front of potential customers and investors.",
                    "All the issues were fixed in the next two weeks and shortly after Cleu was able to get a new batch of Beta users to the platform.",
                    "The founder would decide to work exclusively with Softup going forward in order to maintain the high performance and reliability of the mobile app. He scaled his development team at Softup with 3 developers working full time in order to make Cleu the most promising product in its niche."
                  ]
                }
              },
              {
                "component": "namedDivider",
                "data": {
                  "title": "TESTIMONIALS"
                }
              },
              {
                "component": "testimonial",
                "data": {
                  "content": "Lorem ipsum dolor sit amet, consectetuer adipiscing elit, sed diam consectetuer de adipiscing elit, consectetuer adipiscing elit sed diam.",
                  "author": "LOREM IPSUM"
                }
              }
            ]
          },
          {
            "iconFilename": "realcube.png",
            "title": "REALCUBE",
            "link": "/portfolio/realcube",
            "description": "Property data for owners"
          },
          {
            "iconFilename": "last-supper.png",
            "title": "LAST SUPPER",
            "link": "/portfolio/last-supper",
            "description": "Restaurant management system & client apps"
          },
          {
            "iconFilename": "staffboard.png",
            "title": "STAFFBOARD",
            "link": "/portfolio/staffboard",
            "description": "The software for HR Designers"
          },
          {
            "iconFilename": "salt.png",
            "title": "SALT",
            "link": "/portfolio/salt",
            "description": "Fancy restaurant"
          },
          {
            "iconFilename": "moma.png",
            "title": "MOMA",
            "link": "/portfolio/moma",
            "description": "Easily access your local deals"
          }
        ]
      }
    ]
  },
  {
    "link": "https://www.notion.so/Ready-for-a-Challenge-78fa9cdfe3774736bbd848a91419ac6e",
    "menu": true,
    "number": "04",
    "title": "career.",
    "accordionContent": {
      "description": "Ready for a Challenge? We are glad that you are interested to learn more about opportunities that we have at Softup Technologies. We are growing pretty fast, and we need your help. You can start by learning more about who we are.",
      "content": [
        {
          "component": "slideLinks",
          "data": [
            {
              "link": "https://www.notion.so/Who-are-we-3dd9374b683d49f0858bdcd8eea55de9",
              "name": "Who are we?"
            },
            {
              "link": "https://www.notion.so/Technology-Stack-5b870086e876460bba0f4f09f3e6d009",
              "name": "Technology Stack"
            },
            {
              "link": "https://www.notion.so/Benefits-Why-join-us-c4074149161e4fc7a9573588c1aca07e",
              "name": "Benefits - Why join us?"
            },
            {
              "link": "https://www.notion.so/Our-interview-process-39aa5fb136704bde9e81911409f71be5",
              "name": "Our interview process"
            },
            {
              "link": "https://www.notion.so/Open-job-positions-216572e2b7134ccd95520d066b8d5f76",
              "name": "Open job positions"
            }
          ]
        }
      ]
    }
  },
  {
    "link": "https://medium.com/softup-technologies",
    "menu": true,
    "number": "05",
    "title": "blog.",
    "accordionContent": {
      "description": "We love engineering and we want to share that passion with others too. That’s why we post frequently on our blog about technologies, architecture, side projects, challenges and solutions.",
      "content": [
        {
          "component": "slideLinks",
          "data": []
        }
      ]
    }
  },
  {
    "link": "/privacy-policy",
    "menu": false,
    "title": "privacy policy.",
    "content": [
      {
        "component": "privacyPolicy",
        "data": {
          "links": {
            "cookies": "http://www.allaboutcookies.org",
            "stripe": "https://stripe.com/de/privacy",
            "googlePrivacy": "https://www.google.com/intl/en/policies/privacy/",
            "googleAnalytics": "https://tools.google.com/dlpage/gaoptout",
            "nai": "http://www.networkadvertising.org/understanding-online-advertising/how-does-it-work",
            "facebookAdd": "https://www.facebook.com/settings/?tab=ads",
            "googleAdd": "https://www.google.com/settings/ads/anonymous",
            "daa": "http://optout.aboutads.info/",
            "softup": "info@softup.co"
          }
        }
      }
    ]
  },
  {
    "link": "/imprint",
    "menu": false,
    "title": "imprint.",
    "content": [
      {
        "component": "imprint"
      }
    ]
  }
]
